# https://github.com/Homebrew/homebrew-bundle

# The following packages will be installed on every system
brew "bat"
brew "fastfetch"
brew "fd"
brew "fish"
brew "git-delta"
brew "git-graph"
brew "helix"
brew "jd"
brew "jhead"
brew "jq"
brew "lazygit"
brew "ripgrep"
brew "starship"
brew "television"

{{- if eq .env "client" }}
##########################################################
# client only section
brew "helm"
brew "kubernetes-cli"
brew "kubeseal"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
{{- end }}

{{- if eq .chezmoi.os "darwin" }}
##########################################################
# macOS only section...
brew "container"
cask "firefox"
cask "fork"
cask "ghostty"
cask "tiles"
cask "zed"

{{- if ne .env "work" }}
# non-work macOS -> my private clients ;)
cask "balenaetcher"
cask "keepingyouawake"
cask "raspberry-pi-imager"
cask "spotify"
{{- end }}

{{- end }}
